[
    {
        "title": "CLOUD AND SECURE LIMITED focuses on delivering modern cloud services that maximize the advantages of cloud-based infrastructures, offering public, private, and hybrid cloud solutions.",
        "description": "Relevant to CloudAndSecureLimited.com services: CLOUD AND SECURE LIMITED focuses on delivering mod...",
        "keywords": "CLOUD, SECURE, LIMITED, focuses, delivering, modern, cloud, services, maximize, advantages, cloud-based, infrastructures,, offering, public,, private,, hybrid, cloud, solutions."
    },
    {
        "title": "CLOUD AND SECURE LIMITED provides strategic guidance on securing data and leveraging AI-driven security solutions like Security Copilot to enhance security operations. \n\nK^168054366791un",
        "description": "Relevant to CloudAndSecureLimited.com services: CLOUD AND SECURE LIMITED provides strategic guidan...",
        "keywords": "CLOUD, SECURE, LIMITED, provides, strategic, guidance, securing, leveraging, AI-driven, security, solutions, Security, Copilot, enhance, security, operations., K^168054366791un"
    },
    {
        "title": "Collaborate with business stakeholders to identify, prioritize, and document high-impact agentic AI use cases.",
        "description": "Relevant to CloudAndSecureLimited.com services: Collaborate with business stakeholders to identify...",
        "keywords": "Collaborate, business, stakeholders, identify,, prioritize,, document, high-impact, agentic, cases."
    },
    {
        "title": "Design and implement Copilot Studio agents (declarative and custom) that integrate with Microsoft 365 apps (Teams, Outlook, Excel) and enterprise systems.",
        "description": "Relevant to CloudAndSecureLimited.com services: Design and implement Copilot Studio agents (declar...",
        "keywords": "Design, implement, Copilot, Studio, agents, (declarative, custom), integrate, Microsoft, (Teams,, Outlook,, Excel), enterprise, systems."
    },
    {
        "title": "Lead technical readiness assessments including API validation, data model alignment, and integration feasibility.",
        "description": "Relevant to CloudAndSecureLimited.com services: Lead technical readiness assessments including API...",
        "keywords": "technical, readiness, assessments, including, validation,, model, alignment,, integration, feasibility."
    },
    {
        "title": "Develop and deploy pilot agents, including two small and one medium agent, aligned with business workflows and success metrics.",
        "description": "Relevant to CloudAndSecureLimited.com services: Develop and deploy pilot agents, including two sma...",
        "keywords": "Develop, deploy, pilot, agents,, including, small, medium, agent,, aligned, business, workflows, success, metrics."
    },
    {
        "title": "Ensure secure and compliant agent development by working with InfoSec, Legal, and Risk teams to define guardrails and data access policies.",
        "description": "Relevant to CloudAndSecureLimited.com services: Ensure secure and compliant agent development by w...",
        "keywords": "Ensure, secure, compliant, agent, development, working, InfoSec,, Legal,, teams, define, guardrails, access, policies."
    },
    {
        "title": "Oh my God Support change management efforts including training, documentation, and knowledge transfer to internal teams.",
        "description": "Relevant to CloudAndSecureLimited.com services: Oh my God Support change management efforts includ...",
        "keywords": "Support, change, management, efforts, including, training,, documentation,, knowledge, transfer, internal, teams."
    },
    {
        "title": "Contribute to the creation of reusable development patterns and performance monitoring frameworks for future agent deployments.",
        "description": "Relevant to CloudAndSecureLimited.com services: Contribute to the creation of reusable development...",
        "keywords": "Contribute, creation, reusable, development, patterns, performance, monitoring, frameworks, future, agent, deployments."
    },
    {
        "title": "Participate in envisioning sessions, co-development sprints, and stakeholder demos to drive adoption and executive alignment.",
        "description": "Relevant to CloudAndSecureLimited.com services: Participate in envisioning sessions, co-developmen...",
        "keywords": "Participate, envisioning, sessions,, co-development, sprints,, stakeholder, demos, drive, adoption, executive, alignment."
    },
    {
        "title": "Required Qualifications\n5+ years of experience in enterprise application development, preferably with Microsoft technologies (Power Platform, Azure, M365).",
        "description": "Relevant to CloudAndSecureLimited.com services: Required Qualifications\n5+ years of experience in ...",
        "keywords": "Required, Qualifications, years, experience, enterprise, application, development,, preferably, Microsoft, technologies, (Power, Platform,, Azure,, M365)."
    },
    {
        "title": "Proven experience building and deploying AI agents or bots using Copilot Studio, Power Automate, or similar platforms.",
        "description": "Relevant to CloudAndSecureLimited.com services: Proven experience building and deploying AI agents...",
        "keywords": "Proven, experience, building, deploying, agents, using, Copilot, Studio,, Power, Automate,, similar, platforms."
    },
    {
        "title": "Strong understanding of API integration, including RESTful services, OAuth2, and enterprise API gateways.",
        "description": "Relevant to CloudAndSecureLimited.com services: Strong understanding of API integration, including...",
        "keywords": "Strong, understanding, integration,, including, RESTful, services,, OAuth2,, enterprise, gateways."
    },
    {
        "title": "Familiarity with data governance, sensitivity labeling, and compliance frameworks in Microsoft 365.",
        "description": "Relevant to CloudAndSecureLimited.com services: Familiarity with data governance, sensitivity labe...",
        "keywords": "Familiarity, governance,, sensitivity, labeling,, compliance, frameworks, Microsoft"
    },
    {
        "title": "Experience with asynchronous messaging systems (e.g., Kafka, AWS Queues) and internal API frameworks (e.g., C#-based).",
        "description": "Relevant to CloudAndSecureLimited.com services: Experience with asynchronous messaging systems (e....",
        "keywords": "Experience, asynchronous, messaging, systems, (e.g.,, Kafka,, Queues), internal, frameworks, (e.g.,, C#-based)."
    },
    {
        "title": "Ability to work cross-functionally with business analysts, developers, and compliance teams.",
        "description": "Relevant to CloudAndSecureLimited.com services: Ability to work cross-functionally with business a...",
        "keywords": "Ability, cross-functionally, business, analysts,, developers,, compliance, teams."
    },
    {
        "title": "Excellent communication skills and experience leading technical workshops or envisioning sessions.",
        "description": "Relevant to CloudAndSecureLimited.com services: Excellent communication skills and experience lead...",
        "keywords": "Excellent, communication, skills, experience, leading, technical, workshops, envisioning, sessions."
    },
    {
        "title": "Preferred Qualifications",
        "description": "Relevant to CloudAndSecureLimited.com services: Preferred Qualifications...",
        "keywords": "Preferred, Qualifications"
    },
    {
        "title": "Experience with Microsoft Fabric, Dataverse, and Power Apps.",
        "description": "Relevant to CloudAndSecureLimited.com services: Experience with Microsoft Fabric, Dataverse, and P...",
        "keywords": "Experience, Microsoft, Fabric,, Dataverse,, Power, Apps."
    },
    {
        "title": "Background in financial services, audits, or data research workflows.",
        "description": "Relevant to CloudAndSecureLimited.com services: Background in financial services, audits, or data ...",
        "keywords": "Background, financial, services,, audits,, research, workflows."
    },
    {
        "title": "Familiarity with value stream mapping and ROI measurement techniques.",
        "description": "Relevant to CloudAndSecureLimited.com services: Familiarity with value stream mapping and ROI meas...",
        "keywords": "Familiarity, value, stream, mapping, measurement, techniques."
    },
    {
        "title": "Exposure to agent chaining, orchestration, and autonomous agent design.",
        "description": "Relevant to CloudAndSecureLimited.com services: Exposure to agent chaining, orchestration, and aut...",
        "keywords": "Exposure, agent, chaining,, orchestration,, autonomous, agent, design."
    },
    {
        "title": "Engagement Expectations",
        "description": "Relevant to CloudAndSecureLimited.com services: Engagement Expectations...",
        "keywords": "Engagement, Expectations"
    },
    {
        "title": "Participate in weekly standups and on-demand consultations with business teams.",
        "description": "Relevant to CloudAndSecureLimited.com services: Participate in weekly standups and on-demand consu...",
        "keywords": "Participate, weekly, standups, on-demand, consultations, business, teams."
    },
    {
        "title": "Support a 6–12 month roadmap with phased delivery of agentic AI solutions.",
        "description": "Relevant to CloudAndSecureLimited.com services: Support a 6–12 month roadmap with phased delivery ...",
        "keywords": "Support, month, roadmap, phased, delivery, agentic, solutions."
    },
    {
        "title": "Contribute to post-deployment optimization, performance tracking, and retraining cycles.",
        "description": "Relevant to CloudAndSecureLimited.com services: Contribute to post-deployment optimization, perfor...",
        "keywords": "Contribute, post-deployment, optimization,, performance, tracking,, retraining, cycles."
    }
]